using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace WanaKanaSharp
{
    public class HiraganaRomaji
    {
        public static readonly Dictionary<string, string> HiraganaRomajiDictionary = new Dictionary<string, string>()
        {
            {"あ", "a"},
            {"い", "i"},
            {"う", "u"},
            {"え", "e"},
            {"お", "o"},

            {"か", "ka"},
            {"き", "ki"},
            {"く", "ku"},
            {"け", "ke"},
            {"こ", "ko"},

            {"さ", "sa"},
            {"し", "si"},
            {"す", "su"},
            {"せ", "se"},
            {"そ", "so"},

            {"た", "ta"},
            {"ち", "ti"},
            {"つ", "tu"},
            {"て", "te"},
            {"と", "to"},

            {"な", "na"},
            {"に", "ni"},
            {"ぬ", "nu"},
            {"ね", "ne"},
            {"の", "no"},
            {"ん", "n"},

            {"は", "ha"},
            {"ひ", "hi"},
            {"ふ", "hu"},
            {"へ", "he"},
            {"ほ", "ho"},

            {"ま", "ma"},
            {"み", "mi"},
            {"む", "mu"},
            {"め", "me"},
            {"も", "mo"},


            {"や", "ya"},
            {"ゆ", "yu"},
            {"よ", "yo"},


            {"ら", "ra"},
            {"り", "ri"},
            {"る", "ru"},
            {"れ", "re"},
            {"ろ", "ro"},

            {"わ", "wa"},
            {"を", "wo"},


            {"が", "ga"},
            {"ぎ", "gi"},
            {"ぐ", "gu"},
            {"げ", "ge"},
            {"ご", "go"},


            {"ざ", "za"},
            {"じ", "zi"},
            {"ず", "zu"},
            {"ぜ", "ze"},
            {"ぞ", "zo"},

            {"だ", "da"},
            {"ぢ", "di"},
            {"づ", "du"},
            {"で", "de"},
            {"ど", "do"},

            {"ば", "ba"},
            {"び", "bi"},
            {"ぶ", "bu"},
            {"べ", "be"},
            {"ぼ", "bo"},

            {"ぱ", "pa"},
            {"ぴ", "pi"},
            {"ぷ", "pu"},
            {"ぺ", "pe"},
            {"ぽ", "po"},

            {"きゃ", "kya"},
            {"きゅ", "kyu"},
            {"きょ", "kyo"},

            {"しゃ", "sya"},
            {"しゅ", "syu"},
            {"しょ", "syo"},

            {"ちゃ", "tya"},
            {"ちゅ", "tyu"},
            {"ちょ", "tyo"},

            {"にゃ", "nya"},
            {"にゅ", "nyu"},
            {"にょ", "nyo"},

            {"ひゃ", "hya"},
            {"ひゅ", "hyu"},
            {"ひょ", "hyo"},

            {"みゃ", "mya"},
            {"みゅ", "myu"},
            {"みょ", "myo"},

            {"りゃ", "rya"},
            {"りゅ", "ryu"},
            {"りょ", "ryo"},

            {"ぎゃ", "gya"},
            {"ぎゅ", "gyu"},
            {"ぎょ", "gyo"},

            {"じゃ", "zya"},
            {"じゅ", "zyu"},
            {"じょ", "zyo"},

            {"ぢゃ", "dya"},
            {"ぢゅ", "dyu"},
            {"ぢょ", "dyo"},

            {"びゃ", "bya"},
            {"びゅ", "byu"},
            {"びょ", "byo"},

            {"ぴゃ", "pya"},
            {"ぴゅ", "pyu"},
            {"ぴょ", "pyo"},

            {"くゎ", "kwa"},
            {"ぐゎ", "gwa"},

            {"ぁ", "a"},
            {"ぃ", "i"},
            {"ぅ", "u"},
            {"ぇ", "e"},
            {"ぉ", "o"},
            {"ゃ", "ya"},
            {"ゅ", "yu"},
            {"ょ", "yo"},
            {"ゎ", "wa"},

            {"いぇ", "ye"},
            {"うぃ", "wi"},
            {"うぇ", "we"},
            {"うぉ", "wo"},
            {"きぇ", "kye"},
            {"くぁ", "kwa"},
            {"くぃ", "kwi"},
            {"くぇ", "kwe"},
            {"くぉ", "kwo"},
            {"ぐぁ", "gwa"},
            {"ぐぃ", "gwi"},
            {"ぐぇ", "gwe"},
            {"ぐぉ", "gwo"},

            {"しぇ", "she"},
            {"じぇ", "je"},
            {"ちぇ", "che"},
            {"つぁ", "tsa"},
            {"つぃ", "tsi"},
            {"つぇ", "tse"},
            {"つぉ", "tso"},
            {"てぃ", "ti"},
            {"てゅ", "tyu"},
            {"でぃ", "di"},
            {"でゅ", "dyu"},
            {"とぅ", "tu"},
            {"どぅ", "du"},
            {"にぇ", "nye"},
            {"ひぇ", "hye"},
            {"ふぁ", "fa"},
            {"ふぃ", "fi"},
            {"ふぇ", "fe"},
            {"ふぉ", "fo"},
            {"ふゅ", "fyu" },
            {"ふょ", "fyo"},
        };

        public static readonly Dictionary<string, string> KatakanaRomajiDictionary = new Dictionary<string, string>()
        {
            {"ア", "a"},
            {"イ", "i"},
            {"ウ", "u"},
            {"エ", "e"},
            {"オ", "o"},

            {"カ", "ka"},
            {"キ", "ki"},
            {"ク", "ku"},
            {"ケ", "ke"},
            {"コ", "ko"},

            {"サ", "sa"},
            {"シ", "si"},
            {"ス", "su"},
            {"セ", "se"},
            {"ソ", "so"},

            {"タ", "ta"},
            {"チ", "ti"},
            {"ツ", "tu"},
            {"テ", "te"},
            {"ト", "to"},

            {"ナ", "na"},
            {"ニ", "ni"},
            {"ヌ", "nu"},
            {"ネ", "ne"},
            {"ノ", "no"},
            {"ン", "n"},

            {"ハ", "ha"},
            {"ヒ", "hi"},
            {"フ", "hu"},
            {"ヘ", "he"},
            {"ホ", "ho"},

            {"マ", "ma"},
            {"ミ", "mi"},
            {"ム", "mu"},
            {"メ", "me"},
            {"モ", "mo"},

            {"ヤ", "ya"},
            {"ユ", "yu"},
            {"ヨ", "yo"},

            {"ラ", "ra"},
            {"リ", "ri"},
            {"ル", "ru"},
            {"レ", "re"},
            {"ロ", "ro"},

            {"ワ", "wa"},
            {"ヲ", "wo"},

            {"ガ", "ga"},
            {"ギ", "gi"},
            {"グ", "gu"},
            {"ゲ", "ge"},
            {"ゴ", "go"},


            {"ザ", "za"},
            {"ジ", "zi"},
            {"ズ", "zu"},
            {"ゼ", "ze"},
            {"ゾ", "zo"},

            {"ダ", "da"},
            {"ヂ", "di"},
            {"ヅ", "du"},
            {"デ", "de"},
            {"ド", "do"},

            {"バ", "ba"},
            {"ビ", "bi"},
            {"ブ", "bu"},
            {"ベ", "be"},
            {"ボ", "bo"},

            {"パ", "pa"},
            {"ピ", "pi"},
            {"プ", "pu"},
            {"ペ", "pe"},
            {"ポ", "po"},

            {"キャ", "kya"},
            {"キュ", "kyu"},
            {"キョ", "kyo"},

            {"シャ", "sya"},
            {"シュ", "syu"},
            {"ショ", "syo"},

            {"チャ", "tya"},
            {"チュ", "tyu"},
            {"チョ", "tyo"},

            {"ニャ", "nya"},
            {"ニュ", "nyu"},
            {"ニョ", "nyo"},

            {"ヒャ", "hya"},
            {"ヒュ", "hyu"},
            {"ヒョ", "hyo"},

            {"ミャ", "mya"},
            {"ミュ", "myu"},
            {"ミョ", "myo"},

            {"リャ", "rya"},
            {"リュ", "ryu"},
            {"リョ", "ryo"},

            {"ギャ", "gya"},
            {"ギュ", "gyu"},
            {"ギョ", "gyo"},

            {"ジャ", "zya"},
            {"ジュ", "zyu"},
            {"ジョ", "zyo"},

            {"ヂャ", "dya"},
            {"ヂュ", "dyu"},
            {"ヂョ", "dyo"},

            {"ビャ", "bya"},
            {"ビュ", "byu"},
            {"ビョ", "byo"},

            {"ピャ", "pya"},
            {"ピュ", "pyu"},
            {"ピョ", "pyo"},

            {"クヮ", "kwa"},
            {"グヮ", "gwa"},

            {"ァ", "a"},
            {"ィ", "i"},
            {"ゥ", "u"},
            {"ェ", "e"},
            {"ォ", "o"},
            {"ャ", "ya"},
            {"ュ", "yu"},
            {"ョ", "yo"},
            {"ヮ", "wa"},
            {"ヵ", "ka"},
            {"ヶ", "ke"},

            {"イェ", "ye"},
            {"ウィ", "wi"},
            {"ウェ", "we"},
            {"ウォ", "wo"},
            {"ヴ", "vu" },
            {"ヴァ", "va"},
            {"ヴィ", "vi"},
            {"ヴェ", "ve"},
            {"ヴォ", "vo"},
            {"ヴュ", "vyu"},
            {"ヴョ", "vyo"},
            {"キェ", "kya"},
            {"クァ", "kwa"},
            {"クィ", "kwi"},
            {"クェ", "kwe"},
            {"クォ", "kwo"},
            {"グァ", "gwa"},
            {"グィ", "gwi"},
            {"グェ", "gwe"},
            {"グォ", "gwo"},

            {"シェ", "she"},
            {"ジェ", "je"},
            {"チェ", "che"},
            {"ツァ", "tsa"},
            {"ツィ", "tsi"},
            {"ツェ", "tse"},
            {"ツォ", "tso"},
            {"ティ", "ti"},
            {"テュ", "tyu"},
            {"ディ", "di"},
            {"デュ", "dyu"},
            {"トゥ", "tu"},
            {"ドゥ", "du"},
            {"ニェ", "nye"},
            {"ヒェ", "hye"},
            {"ファ", "fa"},
            {"フィ", "fi"},
            {"フェ", "fe"},
            {"フォ", "fo"},
            {"フュ", "fyu" },
            {"フョ", "fyo"},
        };

        public static readonly Dictionary<string, string> WhitespacePunctuationDictionary = new Dictionary<string, string>()
        {
            {"　", " "},
            {"！", "!"},
            {"“", "\""},
            {"”", "\""},
            {"＃", "#"},
            {"＄", "$"},
            {"％", "%"},
            {"＆", "&"},
            {"’", "'"},
            {"（", "("},
            {"）", ")"},
            {"＝", "="},
            {"～", "~"},
            {"｜", "|"},
            {"＠", "@"},
            {"‘", "`"},
            {"＋", "+"},
            {"＊", "*"},
            {"；", ";"},
            {"：", ":"},
            {"＜", "<"},
            {"＞", ">"},
            {"、", ","},
            {"。", "."},
            {"／", "/"},
            {"？", "?"},
            {"＿", "_"},
            {"・", "･"},
            {"「", "\""},
            {"」", "\""},
            {"｛", "{"},
            {"｝", "}"},
            {"＾", "^" }
        };

        public static readonly Dictionary<string, string> ObsoleteHiraganaDictionary = new Dictionary<string, string>()
        {
            {"wi", "ゐ"},
            {"we", "ゑ" }
        };

        public static readonly Dictionary<string, string> ObsoleteKatakanaDictionary = new Dictionary<string, string>()
        {
            {"wi", "ヰ"},
            {"we", "ヱ" }
        };
    }
}
